---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.Clear
source: html/6b8ecd8a-fbea-b258-c856-750eb37e11e0.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.Clear Method

## Syntax (C#)
```csharp
public virtual void Clear()
```